backend/app/controllers/medicines_controller.rb

SELECT "medicines".* FROM "medicines"
---
  def index
    @medicines = Medicine.all

INSERT INTO "medicines" ("name", "hour", "minute", "second", "memo", "created_at", "updated_at") VALUES ('test', 1, 12, 3, '', '2025-04-15 06:56:52.584110', '2025-04-15 06:56:52.584110') RETURNING "id"
---
  def create
    @medicine = Medicine.new(medicine_params)

    respond_to do |format|
      if @medicine.save

DELETE FROM "medicines" WHERE "medicines"."id" = 1
---
  def destroy
    @medicine.destroy!

SELECT "medicines".* FROM "medicines" WHERE "medicines"."id" = 1 LIMIT 1
---
    def set_medicine
      @medicine = Medicine.find(params.expect(:id))