backend/app/controllers/api/medicines_controller.rb

SELECT "medicines".* FROM "medicines"
---
    def index
      @medicines = Medicine.all

INSERT INTO "medicines" ("name", "hour", "minute", "second", "memo", "created_at", "updated_at") VALUES ('test1', 10, 10, 10, 'test', '2025-04-19 18:06:02.301179', '2025-04-19 18:06:02.301179') RETURNING "id"
---
    def create
      @medicine = Medicine.new(medicine_params)

      if @medicine.save

UPDATE "medicines" SET "minute" = 1, "updated_at" = '2025-04-24 07:20:51.233287' WHERE "medicines"."id" = 3
---
    def update
      if @medicine.update(medicine_params)

DELETE FROM "medicines" WHERE "medicines"."id" = 42
---
    def destroy
      if @medicine.destroy

SELECT "medicines".* FROM "medicines" WHERE "medicines"."id" = 3 LIMIT 1
---
      def set_medicine
        @medicine = Medicine.find(params[:id])