app/controllers/medicine_lists_controller.rb

SELECT "medicine_lists".* FROM "medicine_lists"
---
  def index
    @medicine_lists = MedicineList.all

INSERT INTO "medicine_lists" ("medicineName", "interval", "memo", "created_at", "updated_at") VALUES ('アポトキシン4869', '03:00:00', 'test', '2025-04-12 08:20:36.091333', '2025-04-12 08:20:36.091333') RETURNING "id"
---
  def create
    @medicine_list = MedicineList.new(medicine_list_params)

    respond_to do |format|
      if @medicine_list.save

UPDATE "medicine_lists" SET "interval" = '16:00:00', "memo" = 'test2', "updated_at" = '2025-04-12 13:39:01.997643' WHERE "medicine_lists"."id" = 9
---
  def update
    respond_to do |format|
      if @medicine_list.update(medicine_list_params)

DELETE FROM "medicine_lists" WHERE "medicine_lists"."id" = 1
---
  def destroy
    @medicine_list.destroy!

SELECT "medicine_lists".* FROM "medicine_lists" WHERE "medicine_lists"."id" = 9 LIMIT 1
UPDATE "medicine_lists" SET "updated_at" = '2025-04-12 13:34:23.485448' WHERE "medicine_lists"."id" = 9
---
  def update_timestamp
    @medicine_list = MedicineList.find(params[:id])
    if @medicine_list.touch # updated_at を現在時刻に更新

SELECT "medicine_lists".* FROM "medicine_lists" WHERE "medicine_lists"."id" = 9 LIMIT 1
---
    def set_medicine_list
      @medicine_list = MedicineList.find(params.expect(:id))